#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/sql-intelligence/gh-actions-demo/runs/run-MvLiTXo9sFAcLm7R

Waiting for the plan to start...

Terraform v1.0.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
snowflake_database.demo_db_tf: Refreshing state... [id=DEMO_DB_TF]
snowflake_schema.demo_schema: Refreshing state... [id=DEMO_DB_TF|DEMO_SCHEMA]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # snowflake_sequence.sequence will be created
  + resource "snowflake_sequence" "sequence" {
      + database             = "DEMO_DB_TF"
      + fully_qualified_name = (known after apply)
      + id                   = (known after apply)
      + increment            = 1
      + name                 = "thing_counter"
      + next_value           = (known after apply)
      + schema               = "DEMO_SCHEMA"
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @curt-ntersol, Action: `pull_request`, Working Directory: ``, Workflow: `Snowflake Terraform Demo Workflow`*